#include <stdio.h>
#include <math.h>//підключення бібліотек 
int main(){
int a, b, c, p, s;//оголошення змінних
printf("Введіть ціле значення катета a:");
scanf("%d", &a);
printf("Введіть ціле значення катета b:");
scanf("%d", &b);//введення значень
 c = sqrt(a * a + b * b);
 p = (a + b + c);
 s = sqrt(s * (s - a) * (s - b) * (s - c));//обчислення
printf("Гіпотенуза трикутника дорівнює: %d\n", c);
printf("Периметр трикутника дорівнює: %d\n", p);
printf("Площа трикутника дорівнює: %d\n", s);//виведення значень 
return 0;//кінець програми
}
